tap "norwoodj/tap"
brew "ansible"
brew "bat"
brew "chezmoi"
brew "dive"
brew "docker"
brew "fzf"
brew "gh"
brew "git"
brew "gnupg"
brew "go"
brew "helm"
brew "htop"
brew "istioctl"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubecolor"
brew "kubectx"
brew "kubernetes-cli"
brew "kubie"
brew "lsd"
brew "neofetch"
brew "norwoodj/tap/helm-docs"
brew "nvm"
brew "pinentry-mac"
brew "powerlevel10k"
brew "pre-commit"
brew "rust"
brew "shellcheck"
brew "stern"
brew "trivy"
brew "watch"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zoxide"
cask "bentobox"
cask "font-fira-code-nerd-font"
cask "hyper"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "google.geminicodeassist"
vscode "james-yu.latex-workshop"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-yaml"
vscode "sanaajani.taskrunnercode"
vscode "tim-koehler.helm-intellisense"

{{- if eq .class "work" }}

tap "chainguard-dev/tap"
tap "common-fate/granted"
tap "defenseunicorns/tap"
tap "jorgelbg/tap"
tap "weaveworks/tap"
brew "aws-vault"
brew "awscli"
brew "azure-cli"
brew "caddy"
brew "chainguard-dev/tap/chainctl"
brew "colima"
brew "common-fate/granted/granted"
brew "crane"
brew "defenseunicorns/tap/lula"
brew "defenseunicorns/tap/uds"
brew "defenseunicorns/tap/zarf"
brew "jorgelbg/tap/pinentry-touchid"
brew "opensc"
brew "tofuenv"
brew "weaveworks/tap/eksctl"
cask "session-manager-plugin"
cask "font-teko"
cask "google-cloud-sdk"

{{ else if eq .class "personal" }}

brew "adwaita-icon-theme"
brew "age"
brew "aom"
brew "argocd"
brew "bc"
brew "bind"
brew "ca-certificates"
brew "ccache"
brew "chart-testing"
brew "cilium-cli"
brew "cmake"
brew "cosign"
brew "croc"
brew "dfu-util"
brew "f3"
brew "ffmpeg"
brew "gnu-tar"
brew "gpgme"
brew "gstreamer"
brew "gtk+3"
brew "gtk4"
brew "harfbuzz"
brew "icu4c@76"
brew "imapsync"
brew "iperf3"
brew "jpeg-xl"
brew "kubebuilder"
brew "kubeconform"
brew "libass"
brew "librsvg"
brew "ninja"
brew "nmap"
brew "nss"
brew "numpy"
brew "openblas"
brew "openssl@1.1"
brew "openvino"
brew "pkgconf"
brew "poppler"
brew "py3cairo"
brew "pygobject3"
brew "python@3.11"
brew "python@3.13"
brew "socat"
brew "sops"
brew "telnet"
brew "tesseract"
brew "velero"
brew "virtualenv"
brew "vte3"
brew "wireshark"
brew "yamllint"
brew "youtube-dl"
cask "ha-menu"
cask "kap"
cask "mactex"
cask "mitmproxy"
cask "openscad"
cask "session-manager-plugin"
cask "visual-studio-code"
cask "wireshark"

{{ end }}
